Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Additional option that can be set to have the left and/or right edges of the child clipped to its container's bounds.
zh_cn: 可以设置为将子项的左边和/或右边剪裁到其容器边界的附加选项。

source: Additional option that can be set to have the top and/or bottom edges of the child clipped to its container's bounds.
zh_cn: 可以设置为将子项的顶部和/或底部边缘剪切到其容器边界的附加选项。

source: Additionally, the configuration of the reused bitmap will override the setting of inPreferredConfig, if set.
zh_cn: 此外，重用位图的 configuration 将重写 inPreferredConfig 的设置（如果已设置）。

source: Additionally, we have not yet determined how to make all IDEs use the same ordering.
zh_cn: 此外，我们还没有确定如何让所有 IDE 都使用同一种顺序。

source: Adds a mapping from the specified key to the specified value, replacing the previous mapping from the specified key if there was one.
zh_cn: 添加从指定键到指定值的映射，如果有指定键的映射，则替换以前的映射。

source: Adds a view to a horizontal chain.
zh_cn: 将 view 添加到水平链。

source: Adds a view to a vertical chain.
zh_cn: 将 view 添加到垂直链。

source: Adds any focusable views that are descendants of this view (possibly including this view if it is focusable itself) to views.
zh_cn: 将该 view（调用该方法的 view）的所有可获取焦点的子 view（可能包含自己，如果自己也是可获取焦点的。）添加到 views（指第一个参数）。

source: Adds the source and destination pixels, then subtracts the source pixels multiplied by the destination.
zh_cn: 添加源像素和目标像素，然后减去源像素乘以目标像素。

source: Adds the source pixels to the destination pixels and saturates the result.
zh_cn: 将源像素添加到目标像素并使结果饱和。

source: Adjacent CDATASection nodes are not merged by use of the normalize method of the Node interface.
zh_cn: 通过使用 Node 接口的 normalize 方法，不会合并相邻的 CDATASection 节点。

source: Adjust the alpha of a view.
zh_cn: 调整视图的透明度。

source: Adjust the constraint bias
zh_cn: 调整约束偏差

source: Adjust the elevation of a view.
zh_cn: 调整 view 的 elevation。

source: Adjust the horizontal bias of the view (used with views constrained on left and right).
zh_cn: 调整 view 的水平偏移(与 view 的左右限制一起使用)。

source: Adjust the post-layout X translation of a view.
zh_cn: 调整 view 布局后的 X 方向移动。

source: Adjust the post-layout Y translation of a view.
zh_cn: 调整 view 布局后的 Y 方向移动。

source: Adjust the post-layout rotation about the X axis of a view.
zh_cn: 调整 view 布局后 X 轴的旋转。

source: Adjust the post-layout rotation about the Y axis of a view.
zh_cn: 调整 view 布局后 Y 轴的旋转。

source: Adjust the post-layout scale in X of a view.
zh_cn: 调整 view 布局后 X 轴的缩放。

source: Adjust the post-layout scale in Y of a view.
zh_cn: 调整 view 布局后 Y 轴的缩放。

source: Adjust the post-layout translation of a view.
zh_cn: 调整 view 布局后的移动。

source: Adjust the translation in Z of a view.
zh_cn: 调整 view 布局后的 Z 方向移动。

source: Adjust the vertical bias of the view (used with views constrained on left and right).
zh_cn: 调整 view 的垂直方向的偏移（用于上下限制的 view）（译注：原文可能不对）。

source: Adjust the view margins
zh_cn: 调整 view 边距

source: Adjust the view size
zh_cn: 调整 view 的大小

source: Adjust the visibility of a view.
zh_cn: 调整 view 的可见性。

source: Admittedly this is a simple case, but that's the point — creating custom components is only as complicated as you need it to be.
zh_cn: 诚然，这只是一个简单的例子，但关键是——创建自定义 view 你需要有多复杂，就创建成多复杂。

source: After that any object (other than a bitmap) that is drawn with that paint will get its color(s) from the shader.
zh_cn: 之后，用该 paint 绘制的任何对象（除 bitmap 之外）都将从 shader 中获取它的颜色。

source: After that, you can compile your release build.
zh_cn: 之后，你可以编译发布版本。

source: After the finalize method has been invoked for an object, no further action is taken until the Java virtual machine has again determined that there is no longer any means by which this object can be accessed by any thread that has not yet died, including possible actions by other objects or classes which are ready to be finalized, at which point the object may be discarded.
zh_cn: 在为对象调用 finalize 方法后，不会采取进一步的操作，直到 Java 虚拟机再次确定这个对象不再被任何尚未死亡的线程访问，除非是由于某个其他准备 finalize 的对象或类的准备而产生的动作的结果，此时物体可能会被丢弃。

source: After the app process creates your activity, the activity performs the following operations:
zh_cn: 应用程序进程创建 activity 后，activity 将执行以下操作：

source: After this, the drawing commands of the entire tree are issued to screen, clipped to the newly damaged area.
zh_cn: 然后，整个 view 树的绘制命令向屏幕发出，裁去被破坏的区域。

source: Afterwards, the app spawns the main thread, also known as the UI thread, and tasks it with creating your main activity.
zh_cn: 之后，应用程序会生成主线程（也称为 UI 线程），并通过创建主 activity 来执行任务。

source: Afterwards, you need to update the Scroller by calling Scroller.computeScrollOffset() at regular intervals.
zh_cn: 之后，你需要定期调用 Scroller.computeScrollOffset() 来更新 Scroller。

source: Alias for delete(int).
zh_cn: delete(int) 的别名。

source: Align the edge of a view to the same edge of another view.
zh_cn: 将 view 的边缘与另一个 view 的相同边缘对齐。

source: Align the text baseline of a view to the text baseline of another view.
zh_cn: 将 view 的文本基线与另一个 view 的文本基线对齐。

source: Align to the end of the paragraph, e.g.
zh_cn: 与段落末尾对齐，例如。

source: Align to the end of the view, which is ALIGN_RIGHT if the view’s resolved layoutDirection is LTR, and ALIGN_LEFT otherwise.
zh_cn: 对齐 view 的末尾，如果 view 的已解析 layoutDirection 为 LTR，则为 ALIGN_RIGHT，否则为 ALIGN_LEFT。

source: Align to the start of the paragraph, e.g.
zh_cn: 与段落的开头对齐，例如。

source: Align to the start of the view, which is ALIGN_LEFT if the view’s resolved layoutDirection is LTR, and ALIGN_RIGHT otherwise.
zh_cn: 与 view 的开头对齐，如果 view 的已解析 layoutDirection 为 LTR，则为 ALIGN_LEFT，否则为 ALIGN_RIGHT。

source: Alignment
zh_cn: 对齐

source: Alignments specify where a view should be placed within a cell group and what size it should be.
zh_cn: Alignment 指定 view 应放置在单元格组中的位置以及应该具有的大小。

source: All ItemDecorations are drawn in the order they were added, before the item views (in onDraw() and after the items (in onDrawOver(Canvas, RecyclerView, RecyclerView.State).
zh_cn: 所有的 ItemDecorations 按它们加入的顺序被绘制，在 item views 之前(在 onDraw() 中且在 items 之后 (在 onDrawOver(Canvas, RecyclerView, RecyclerView.State) 中。

source: All SurfaceView and SurfaceHolder.Callback methods will be called from the thread running the SurfaceView's window (typically the main thread of the application).
zh_cn: 将从运行 SurfaceView 窗口的线程(通常是应用程序的主线程)调用所有 SurfaceView 和 SurfaceHolder.Callback 方法。

source: All attributes from Chip are supported.
zh_cn: Chip 的所有属性都受支持。

source: All attributes from MaterialButton are supported.
zh_cn: 支持 MaterialButton 中的所有属性。

source: All formats supported by BitmapRegionDecoder support Bitmap reuse via inBitmap.
zh_cn: BitmapRegionDecoder 支持的所有格式都支持通过 inBitmap 重用位图。

source: All margins offered by the tool are factors of 8dp to help your views align to Material Design's 8dp square grid recommendations.
zh_cn: 该工具提供的所有边距默认是 8dp，以帮助你的 view 符合 Material Design 的 8dp square grid recommendations 建议。

source: All of the view classes defined in the Android framework extend View.
zh_cn: Android 框架中定义的所有 view 类都继承了 View。

source: All of the views in a window are arranged in a single tree.
zh_cn: 窗口中的所有 view 都排列在一棵树中。

source: All of these tools can reduce PNG file size while preserving the perceptive image quality.
zh_cn: 所有这些工具都可以减少 PNG 文件的大小，同时保持感知的图像质量。

source: All string literals in Java programs, such as "abc", are implemented as instances of this class.
zh_cn: Java 程序中的所有字符串字面值（如 "abc" ）都作为此类的实例实现。

source: All the example diagrams presented below use the same source and destination images:
zh_cn: 下面介绍的所有示例图都使用相同的源图像和目标图像：

source: All the power of ConstraintLayout is available directly from the Layout Editor's visual tools, because the layout API and the Layout Editor were specially built for each other.
zh_cn: ConstraintLayout 的所有功能都可以从布局编辑器的可视化工具中直接获得，因为布局 API 和布局编辑器是专为彼此构建的。

source: All the string building for the log also needs to be placed inside the if (LOCAL_LOG) block.
zh_cn: 为日志编译的所有字符串也需要放在 if (LOCAL_LOG) 块中。

source: Allocate objects during initialization, or between animations.
zh_cn: 在初始化期间或动画之间分配对象。

source: Allow a user to over-scroll this view only if the content is large enough to meaningfully scroll, provided it is a view that can scroll.
zh_cn: 仅当内容足够大才能有意义地滚动时，允许用户过度滚动此 view，前提是它是可以滚动的 view。

source: Allow the app to load and display your views, and then later update visual properties that are dependent on bitmaps and other resources.
zh_cn: 允许应用加载并显示你的视图，然后更新依赖于位图和其他资源的可视属性。

source: Allows the caller to manually dispatch onDependentViewChanged(CoordinatorLayout, View, View) to the associated CoordinatorLayout.Behavior instances of views which depend on the provided View.
zh_cn: 允许调用者手动将 onDependentViewChanged(CoordinatorLayout, View, View) 分发给关联的 CoordinatorLayout.Behavior 实例 view 取决于提供的 View。

source: Allows to enable the indeterminate mode.
zh_cn: 允许启用不确定模式。

source: Alpha compositing modes
zh_cn: Alpha 合成模式

source: Alpha set to 0xFF.
zh_cn: Alpha 设置为 0xFF。

source: Alphabetical within each grouping, with capital letters before lower case letters (e.g. Z before a).
zh_cn: 每个分组内按字母顺序排序，其中大写字母开头的语句位于小写字母开头的语句前面(例如 Z 在 a 前面)。

source: Also do not use the android:drawableStart and android:drawableEnd attributes.
zh_cn: 另外不要使用 android:drawableStart 和 android:drawableEnd 属性。

source: Also if there is already a view that is handling the gesture, do normal event dispatch.
zh_cn: 另外，如果已经有一个 view 正在处理该手势，执行正常的事件分发。

source: Also note that the audio session id (from getAudioSessionId()) may change from its previously returned value when the VideoView is restored.
zh_cn: 另请注意，恢复 VideoView 时，音频会话 ID(来自 getAudioSessionId())可能会从之前返回的值更改。

source: Also see ConstraintLayout.LayoutParams for layout attributes
zh_cn: 另请参阅 ConstraintLayout.LayoutParams 的布局属性。

source: Also see LayoutParams for layout attributes.
zh_cn: 另请参阅布局属性的 LayoutParams。

source: Also see LinearLayoutCompat.LayoutParams for layout attributes
zh_cn: 另请参阅布局属性的 LinearLayoutCompat.LayoutParams

source: Also see RelativeLayout.LayoutParams for layout attributes
zh_cn: 另请参阅布局属性的 RelativeLayout.LayoutParams

source: Also see TableRow.LayoutParams for layout attributes
zh_cn: 另请参阅 TableRow.LayoutParams 以获取布局属性

source: Also supports:
zh_cn: 还支持：

source: Also, by returning true from onTouchEvent(), you will not receive any following events in onInterceptTouchEvent() and all touch processing must happen in onTouchEvent() like normal.
zh_cn: 此外，通过从 onTouchEvent() 返回 true，你将不会在 onInterceptTouchEvent() 中收到任何后续事件，并且所有触摸必须像正常一样在 onTouchEvent() 中处理。

source: Also, consider using a dependency injection framework like Dagger that creates objects and dependencies are when they are injected for the first time.
zh_cn: 另外，考虑使用像 Dagger 这样的依赖注入框架，它们在第一次注入时创建对象和依赖。

source: Also, it doesn't remove resources; it only alerts you to their presence.
zh_cn: 并且，它不会移除资源;它只会提醒你他们的存在。

source: Also, it forces the user to wait with no feedback while the activity launches, making them wonder if the app is functioning properly.
zh_cn: 此外，它强迫用户在 activity 启动时没有反馈地等待，使他们怀疑应用程序是否正常工作。

source: Also, remember that an ID resources does not reference an actual resource item; it is simply a unique ID that you can attach to other resources or use as a unique integer in your application.
zh_cn: 另外，请记住 ID 资源不引用实际资源项;它只是一个唯一的 ID，你可以将其附加到其他资源或作为应用程序中的唯一整数使用。

source: Alternatively, If you want CardView to add inner padding on platforms Lollipop and after as well, you can call setUseCompatPadding(boolean) and pass true.
zh_cn: 或者，如果你希望 CardView 在 Lollipop 平台上添加内部填充，之后也可以调用 setUseCompatPadding(boolean) 并传递 true。

source: Alternatively, you can use the pre-3.0 animation classes to animate how Views are rendered.
zh_cn: 当然，你也可以用 3.0 以前的动画类来按制 view 的渲染。

source: Alternatives to catching generic Exception:
zh_cn: 捕获常规异常的替代方案：

source: Although View has many methods for handling measurement, most of them do not need to be overridden.
zh_cn: 虽然 View 有许多处理测量的方法，但大多数方法都不需要重写。

source: Although Android supports all these densities, you don't need to export your rasterized assets to each density.
zh_cn: 虽然 Android 支持所有这些密度，但你无需将 rasterized 资源导出到每个密度。

source: Although a missing constraint won't cause a compilation error, the Layout Editor indicates missing constraints as an error in the toolbar.
zh_cn: 尽管缺少了约束也不会造成编译错误，布局编辑器将会在工具栏上显示有一个缺少约束的错误。

source: Although cells do not normally overlap in a GridLayout, GridLayout does not prevent children being defined to occupy the same cell or group of cells.
zh_cn: 虽然单元格在 GridLayout 中通常不会重叠，但 GridLayout 并不会阻止定义子项占用相同的单元格或单元格组。

source: Although it's not strictly necessary to follow this convention, many popular code editors depend on this naming convention to provide statement completion.
zh_cn: 尽管遵循此约定并非绝对必要，但许多流行的代码编辑器依赖于此命名约定来提供语句补全。

source: Although it's possible to read values from the AttributeSet directly, doing so has some disadvantages:
zh_cn: 虽然可以直接从 AttributeSet 中读取值，但这样做有一些缺点：

source: Although the UI may occupy the same space, the ActionMode APIs are distinct and independent from those for ActionBar.
zh_cn: 虽然 UI 可能占用相同的空间，但 ActionMode API 与 ActionBar 的 API 不同且独立。

source: Although the orientation of a chain is either vertical or horizontal, using one does not align the views in that direction.
zh_cn: 虽然链的取向是垂直或水平的，无论使用哪一个一个方向都不会使该方向上的视图对齐。

source: Although the typical child of a TableLayout is a TableRow, you can actually use any View subclass as a direct child of TableLayout.
zh_cn: 虽然 TableLayout 的典型子项是 TableRow，但实际上可以使用任何 View 子类作为 TableLayout 的直接子项。

source: Although these properties can be changed with setMutableRequired(true) (which is only compatible with decodeBitmap(Source) and decodeBitmap(Source, OnHeaderDecodedListener)) and setAllocator(int), it is also possible to apply custom effects regardless of the mutability of the final returned object by passing a PostProcessor to setPostProcessor.
zh_cn: 虽然可以使用 setMutableRequired(true)（仅与 decodeBitmap(Source) 和 decodeBitmap(Source, OnHeaderDecodedListener)兼容）和 setAllocator(int) 来更改这些属性，也可以通过将 PostProcessor 传递给 setPostProcessor 来应用自定义效果以确定最终返回对象的可变性。

source: Always allow a user to over-scroll this view, provided it is a view that can scroll.
zh_cn: 始终允许用户过度滚动此 view，前提是它是可以滚动的 view。

source: Among the layouts available are LinearLayout, FrameLayout, RelativeLayout, and others.
zh_cn: 可用的布局包括 LinearLayout, FrameLayout, RelativeLayout 及其他。

source: Among them is extending an EditText View to make a lined notepad.
zh_cn: 其中包括继承 EditText 视图以制作一个 lined notepad。

source: Among them, only AndroidManifest.xml is mandatory.
zh_cn: 其中，只有 AndroidManifest.xml 是必需的。

source: Amount of padding on either side of text within the switch thumb.
zh_cn: 切换 thumb 内文本两侧的填充量。

source: Amount of pixels by which the drop down should be offset horizontally.
zh_cn: 下拉应该水平偏移的像素数量。

source: Amount of pixels by which the drop down should be offset vertically.
zh_cn: 下拉列应垂直偏移的像素数量。

source: An IllegalArgumentException will be thrown by decodeDrawable/ decodeBitmap when setting a non-RGB color space such as Lab.
zh_cn: 设置非 RGB 颜色空间时，例如 Lab ，decodeDrawable / decodeBitmap 将抛出 IllegalArgumentException 。

source: An IllegalArgumentException will be thrown by the decode methods if calling ColorSpace.Rgb.getTransferParameters() on the specified color space returns null.
zh_cn: 如果在指定的颜色空间上调用 ColorSpace.Rgb.getTransferParameters()，则解码方法将抛出 IllegalArgumentException。

source: An APK also contains the following files.
zh_cn: APK 还包含以下文件。

source: An APK contains the following directories:
zh_cn: APK 包含以下目录：

source: An APK file consists of a ZIP archive that contains all the files that comprise your app.
zh_cn: APK 文件由 ZIP 存档组成，其中包含构成应用程序的所有文件。

source: An AccessibilityDelegate intended to be set on an EditText or TextInputEditText with {@link TextInputLayout#setTextInputAccessibilityDelegate(TextInputLayout.AccessibilityDelegate) to provide attributes for accessibility that are managed by {@link TextInputLayout}.
zh_cn: AccessibilityDelegate 旨在使用 {@link TextInputLayout #setTextInputAccessibilityDelegate（TextInputLayout.AccessibilityDelegate）在 EditText 或 TextInputEditText 上设置，以提供由 {@link TextInputLayout} 管理的可访问性属性。

source: An AdapterView is a view whose children are determined by an Adapter.
zh_cn: AdapterView 是一个 view，其子 view 由 Adapter 确定。

source: An Exception was thrown reading the ImageDecoder.Source.
zh_cn: 抛出异常当读取 ImageDecoder.Source 时。

source: An ItemDecoration allows the application to add a special drawing and layout offset to specific item views from the adapter's data set.
zh_cn: ItemDecoration 允许应用为特定的 item view（来自 adapter 的数据集）添加一个特殊的绘制和布局偏移。

source: An OnItemTouchListener allows the application to intercept touch events in progress at the view hierarchy level of the RecyclerView before those touch events are considered for RecyclerView's own scrolling behavior.
zh_cn: OnItemTouchListener 允许应用程序在 RecyclerView 自己的滚动行为被考虑之前，在 RecyclerView 的视图层次结构级别拦截正在进行的触摸事件。

source: An OnScrollListener can be added to a RecyclerView to receive messages when a scrolling event has occurred on that RecyclerView.
zh_cn: OnScrollListener 可以添加给 RecyclerView 以在该 RecyclerView 发生滚动事件时接收消息。

source: An abstract base class for spinner widgets.
zh_cn: spinner 小部件的抽象基类。

source: An action view may be expanded either directly from the MenuItem it belongs to or by user action.
zh_cn: 可以直接从它所属的 MenuItem 或通过用户操作扩展操作 view。

source: An additional flag for 'enterAlways' which modifies the returning view to only initially scroll back to it's collapsed height.
zh_cn: 用于 'enterAlways' 的一个额外标志，它修改返回的 view，使其最初时只是回滚到它的折叠高度。

source: An additional flag to be used with 'snap'.
zh_cn: 与 'snap' 一起使用的附加标志。

source: An app may set this to false to indicate that the fragment's UI is scrolled out of visibility or is otherwise not directly visible to the user.
zh_cn: 一个应用可能会设置它为 false 以指明 Fragment 的 UI 滚出了可见或者对用户不是直接可见的。

source: An app with a slow start time doesn’t meet this expectation, and can be disappointing to users.
zh_cn: 启动时间较慢的应用程序无法满足此预期，并且可能会令用户失望。

source: An application may choose to designate a Toolbar as the action bar for an Activity using the setActionBar() method.
zh_cn: 应用程序可以选择使用 setActionBar() 方法将工具栏指定为 activity 的操作栏。

source: An application may choose to designate a Toolbar as the action bar for an Activity using the setSupportActionBar() method.
zh_cn: 应用程序可以选择使用 setSupportActionBar() 方法将工具栏指定为 activity 的操作栏。

source: An array of integers defined in XML.
zh_cn: XML 中定义的整数数组。

source: An easy way to do this is with an XML drawable "selector." For example:
zh_cn: 一个简单的方法是使用 XML drawable“selector”。例如：

source: An editable text view that shows completion suggestions automatically while the user is typing.
zh_cn: 可编辑的文本 view，可在用户键入时自动显示补全建议。

source: An editable text view, extending AutoCompleteTextView, that can show completion suggestions for the substring of the text where the user is typing instead of necessarily for the entire thing.
zh_cn: 一个可编辑的文本 view，扩展了 AutoCompleteTextView，可以显示用户正在键入的文本的子字符串的补全建议，而不是必须输入整个内容。

source: An engine that performs match operations on a character sequence by interpreting a Pattern.
zh_cn: 通过解释 Pattern 对 character sequence 执行匹配操作的引擎。

source: An event comes in and is dispatched to the appropriate view.
zh_cn: 收到一个事件然后分发给适当的 view。

source: An example of this is a drawer that contains a scrollable list.
zh_cn: 一个示例是包含可滚动列表的抽屉。

source: An example usage is as so:
zh_cn: 示例用法如下：

source: An example usage is like so:
zh_cn: 示例用法如下：

source: An example use of a NinePatch is the backgrounds used by standard Android buttons — buttons must stretch to accommodate strings of various lengths.
zh_cn: 标准的安卓按钮就是使用 NinePatch 作为背景的例子——按钮需要缩放以适应字符串长度的变化。

source: An excellent tutorial and overview of regular expressions is Mastering Regular Expressions, Jeffrey E. F. Friedl, O'Reilly and Associates, 1997.
zh_cn: 有关正则表达式的优秀教程和概述，请参阅 Mastering Regular Expressions, Jeffrey E. F. Friedl, O'Reilly and Associates, 1997.

source: An explicit exception is made for java standard libraries (java.util.*, java.io.*, etc.) and unit test code (junit.framework.*).
zh_cn: 不过导入 java 标准库（java.util.*、 java.io.* 等）和单元测试代码 (junit.framework.*）时可以例外。（译注：这里和官方汉化不一致，官方汉化为“在 Java 标准库（java.util.*、java.io.* 等）和单元测试代码 (junit.framework.*) 中创建显式异常。”）。

source: An extension to TextView that supports the Checkable interface and displays.
zh_cn: TextView 的扩展，支持 Checkable 接口和显示。

source: An icon must be set for the navigation button to appear.
zh_cn: 必须设置一个图标才能显示导航按钮。

source: An implementation may choose to use the consumed portion to match or chase scroll position of multiple child elements, for example.
zh_cn: 例如，实现可以选择使用所消费的部分来匹配或跟踪多个子元素的滚动位置。

source: An implementation of RecyclerView.OnItemTouchListener that has empty method bodies and default return values.
zh_cn: RecyclerView.OnItemTouchListener 的一个实现，只有空的方法体和默认的返回值。

source: An implementation of SurfaceView that uses the dedicated surface for displaying OpenGL rendering.
zh_cn: SurfaceView 的一种实现，它使用专用 surface 来显示 OpenGL 渲染。

source: An inputType of "numericPassword" results in an edit text that accepts numbers only, shows a numeric keyboard when focused, and masks the text that is entered for privacy.
zh_cn: inputType 为“numericPassword”会导致编辑文本仅接受数字，在聚焦时显示数字键盘，并屏蔽为隐私输入的文本。

source: An instance of the Pattern class represents a regular expression that is specified in string form in a syntax similar to that used by Perl.
zh_cn: Pattern 类的实例采用类似于 Perl 的语法来表示以字符串形式指定的正则表达式。

source: An integer defined in XML.
zh_cn: XML 中定义的整数。

source: An optional argument to supply a maximum height for this view.
zh_cn: 一个可选参数，用于为此 view 提供最大高度。

source: An optional argument to supply a maximum width for this view.
zh_cn: 一个可选参数，用于为此 view 提供最大宽度。

source: An optional maximum width of the SearchView.
zh_cn: SearchView 的可选最大宽度。

source: An optional payload can be passed to each changed item.
zh_cn: 可选的有效负载可以传递给每个更改的项。

source: An optional query hint string to be displayed in the empty query field.
zh_cn: 要在空查询域中显示的可选查询提示字符串。

source: An overridden onDraw() method to draw the label onto the provided canvas.
zh_cn: 重写 onDraw() 方法，在提供的画布上画出标签。

source: An overridden onMeasure method to determine and set the rendering size of the component.
zh_cn: 重写 onMeasure 方法来确定和设置组件呈现的大小。

source: And that's all there is to it.
zh_cn: 这就是所有的内容了。

source: Android Studio can convert PNG, JPG, BMP, or static GIF images to WebP format.
zh_cn: Android Studio 可以将 PNG，JPG，BMP 或静态 GIF 图像转换为 WebP 格式。

source: Android does not currently enforce a specific style for writing Javadoc comments, but you should follow the instructions How to Write Doc Comments for the Javadoc Tool.
zh_cn: Android 目前并不强制要求采用特定样式来编写 Javadoc 备注，但建议你参照 How to Write Doc Comments for the Javadoc Tool 中的说明。

source: Android doesn't use finalizers.
zh_cn: Android 不使用终结器。

source: Android follows standard Java coding conventions with the additional rules described below.
zh_cn: Android 遵循标准 Java 编码规范以及下文所述的其他规则。

source: Android imports
zh_cn: 导入 Android 包

source: Android offers a sophisticated and powerful componentized model for building your UI, based on the fundamental layout classes: View and ViewGroup.
zh_cn: 基于基本的布局类： View 和 ViewGroup，安卓提供了一套精致而强大的组件化模型来构建你的 UI。

source: Android provides several means of letting you know that your app has a problem, and to help you diagnose it.
zh_cn: Android 提供了多种方法让你知道你的应用存在问题，并帮助你进行诊断。

source: Android provides several utilities to change the color of an asset, either using the android:tint and tintMode attributes on Android 5.0 (API level 21) and higher.
zh_cn: Android 提供了几个实用程序来更改资源的颜色，使用 Android 5.0(API 级别 21)及更高版本上的 android:tint 和 tintMode 属性。

source: Android standard practices for the three predefined annotations in Java are:
zh_cn: Java 中 3 个预定义注释的 Android 标准做法如下：

source: Android supplies a standard layout resource for TwoLineListView (which does not include a selected item icon), but you can design your own custom XML layout for this object.
zh_cn: Android 为 TwoLineListView 提供标准布局资源(不包括选定的项目图标)，但你可以为此对象设计自己的自定义 XML 布局。

source: Android supports a very large set of devices, encompassing a variety of screen densities.
zh_cn: Android 支持大量设备，包括各种屏幕密度。
